In [1]:
import pandas as pd

In [2]:
from sqlalchemy import create_engine,inspect

In [3]:
db_file = r'gradedata.db'

In [4]:
engine = create_engine(f"sqlite:///{db_file}")

In [5]:
engine.table_names()

['test']

In [6]:
engine.has_table('students')

False

In [7]:
inspector = inspect(engine)

In [8]:
print(inspector.get_columns('test'))

[{'name': 'index', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}, {'name': 'Names', 'type': TEXT(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}, {'name': 'Grades', 'type': INTEGER(), 'nullable': True, 'default': None, 'autoincrement': 'auto', 'primary_key': 0}]

In [10]:
fields=inspector.get_columns('test')

In [11]:
field_names = pd.DataFrame.from_dict(fields)

In [12]:
field_names

     name     type  nullable default autoincrement  primary_key
0   index  INTEGER      True    None          auto            0
1   Names     TEXT      True    None          auto            0
2  Grades  INTEGER      True    None          auto            0

In [13]:
sql= "SELECT * FROM test;"

In [15]:
sales_data_df = pd.read_sql(sql, engine)
sales_data_df

   index    Names  Grades
0      0      Bob      76
1      1  Jessica      95
2      2     Mary      77
3      3     John      78
4      4      Mel      99

In [16]:
sql= "SELECT * FROM test WHERE Grades IN (76,77,78);"

In [17]:
grades_df= pd.read_sql(sql,engine)

In [19]:
grades_df

   index Names  Grades
0      0   Bob      76
1      2  Mary      77
2      3  John      78